tutorials/uweBourdonTwoViscosities/0/pFastener
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      pFastener;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    innerRadius
    {
        type            zeroGradient;
    }
    outerRadius
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    leftHand
    {
        type            zeroGradient;
    }
    rightHand
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
