tutorials/uweBourdonTwoViscosities/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 
transportModel powerLaw;
nu nu	[ 0 2 -1 0 0 0 0 ] 0.1 ; 

powerLawCoeffs
{
nuMin nuMin 	[ 0 2 -1 0 0 0 0 ] 1e-12 ; 
nuMax nuMax 	[ 0 2 -1 0 0 0 0 ] 1e12 ;
k k 		[0 2 -1 0 0 0 0] 0.1;
n n 		[0 0 0 0 0 0 0] 1; 
}
// 		    nu0 is viscosity at zero shear rate
//		    nuInf is viscosity at infinite shear rate
// 		    m determines where the slope starts, you can find the start at a shear rate of (1/m) [1/s]
// 		    n shows how steep the slope is: n=0.1 is a very gentle slope, n=3 means you lose 3 decades of nu in one decade of shear rate




DT		DT  [0 2 -1 0 0 0 0] 3e-7;
c		c   [0 2 -2 -1 0 0 0] 1900;
//		DT is the thermal diffusivity (german literature alpha_t). is defined as: (thermal conductivity kappa or lambda) / (density*c)
//		c is the heat capacity.

Dconcentration		Dconcentration  [0 2 -1 0 0 0 0] 1e-12;
DresidenceTime		DresidenceTime	[0 2 -1 0 0 0 0] 1e-12;

rhoFluid		rhoFluid [1 -3 0 0 0 0 0] 736;
//rho is density in kg/m³

meltPressurePrefixScalar meltPressurePrefixScalar  [0 0 0 0 0 0 0] 01;

materialsToAlpha  materialsToAlpha  [0 0 -1 0 0 0 0] 1e10;
//higher values: more flow resistance.

fastenerPrefixScalar fastenerPrefixScalar [0 0 0 0 0 0 0] 1;
tauPrefixScalar tauPrefixScalar [0 1 -1 0 0 0 0] 1;
verbose	verbose [0 0 0 0 0 0 0]	0;


// ************************************************************************* //
